{
  "messages": [
    {
      "id": "msg_1",
      "text": "Слушай внимательно.\n\nТы попал сюда не случайно. Это альфа-тест проекта о цифровой свободе. Я дам тебе инструменты, которые изменят то, как ты думаешь о свободе в интернете.\n\n10-15 минут. Это всё, что тебе нужно для начала\nЭто проще, чем заказать пиццу в Glovo. Серьёзно.\nНикаких:\n- Регистраций\n- Подписок\n- Личных данных\n- Банковских карт\nТолько ты и этот чат.\n\nВот сделка: За каждый правильный ответ ты получаешь части настоящих биткоинов.\nШкала внизу показывает твой прогресс. Каждый процент — это деньги.\nВерить или нет — твой выбор.\nНо если ты здесь, значит чувствуешь, что что-то не так с системой.\nГотов сделать первый шаг?",
      "buttons": ["Да", "Нет"]
    },
    {
      "id": "msg_1_no",
      "condition": "if user chooses 'Нет'",
      "text": "Понимаю. Система удобна. Если передумаешь — я буду здесь."
    },
    {
      "id": "msg_2",
      "condition": "if user chooses 'Да'",
      "text": "Ты на верном пути!\nДавай начнем с простого вопроса: кому принадлежат деньги на твоем счету?",
      "buttons": ["Мне", "Банку"]
    },
    {
      "id": "msg_3_mine",
      "condition": "if user chooses 'Мне'",
      "text": "На самом деле нет, хотя банк говорит тебе, что это твои деньги.\n\nНесмотря на то, что их приложение и показывает баланс, эти деньги не твоя собственность. Это запись в ИХ базе данных, которую тебе РАЗРЕШАЮТ использовать.\nПопробуй вот что:\nОтправь крупную сумму другу в другую страну. Банк обязательно спросит: «Откуда деньги? Зачем? Кому?» Они могут заблокировать твой счет просто потому, что их алгоритму не понравилась твоя покупка.\nРешил купить что-то, что не нравится твоему правительству? Может быть, пожертвование протестующим, запрещенную книгу или VPN? Счет заморожен. Без суда.\nДеньги в банке — это не деньги. Это обещание банка.\nИ это обещание работает, пока ты делаешь то, что от тебя ожидают.\nОни контролируют доступ к твоему времени, твоему труду, твоей жизни.\nТы работаешь всю неделю и обмениваешь это время на цифры в приложении. А цифры принадлежат не тебе.\nБанк — хозяин твоего времени.\n«Баланс в приложении» — это не владение, разрешение.",
      "buttons": ["Ну да, но что с этим делать?", "Но так было всегда, это нормально"]
    },
    {
      "id": "msg_3_bank",
      "condition": "if user chooses 'Банку'",
      "text": "Верно, хотя банк говорит тебе, что это твои деньги.\n\nХотя их приложение и показывает баланс, эти деньги не твоя собственность. Это запись в их базе данных, которую тебе разрешают использовать.\nПопробуй вот что:\nОтправь крупную сумму другу в другую страну. Банк обязательно спросит: «Откуда деньги? Зачем? Кому?» Они могут заблокировать твой счет просто потому, что их алгоритму не понравилась твоя покупка.\nРешил купить что-то, что не нравится твоему правительству? Может быть, пожертвование протестующим, запрещенную книгу или VPN? Счет заморожен. Без суда.\nДеньги в банке — это не деньги. Это обещание банка.\nИ это обещание работает, пока ты делаешь то, что от тебя ожидают.\nОни контролируют доступ к твоему времени, твоему труду, твоей жизни.\nТы работаешь всю неделю и обмениваешь это время на цифры в приложении. А цифры принадлежат не тебе.\nБанк — хозяин твоего времени.\n«Баланс в приложении» — это не владение, разрешение.",
      "buttons": ["Ну да, но что с этим делать?", "Но так было всегда, это нормально"]
    },
    {
      "id": "msg_4_normal",
      "condition": "if user chooses 'Но так было всегда, это нормально'",
      "text": "\"Нормально\" — это когда банк берет комиссию за хранение ТВОИХ денег.\n\n\"Нормально\" — это когда ты не можешь купить билет в другую страну без одобрения банка.\n\nРабство тоже когда-то было \"нормально\".\n\nГотов увидеть выход или вернешься к «нормальности»?",
      "buttons": ["Покажи выход", "Вернуться к началу"]
    },
    {
      "id": "msg_5_bitcoin",
      "condition": "if user chooses 'Покажи выход' OR 'Ну да, но что с этим делать?'",
      "text": "Хорошо. Ты готов увидеть выход.\n\nЭто Bitcoin!\n\nЗабудь всё, что ты слышал о нём: \"криптовалюта\", \"инвестиция\", \"спекуляция\".\nНа самом деле Bitcoin это математика, которую невозможно подделать.\nПредставь золото. Его нельзя напечатать. Его количество ограничено. Его ценность признают люди во всем мире.\n\nТеперь представь, что золото:\n- Помещается в зашифрованном файле в твоем телефоне\n- Его можно отправить за секунды в любую страну\n- Никто не может его конфисковать\n- Никакой банк его не контролирует\n\n21 миллион монет. Больше никогда не будет. Никакой центральный банк не может напечатать еще.\nЭто не обещание. Это неизменяемый математический закон, записанный в коде навсегда.\nБанк может обанкротиться. Правительство может обесценить деньги.\nBitcoin? Работает 17 лет без остановки. 24/7. Без выходных. Без банкротств.\nЭто первый в истории способ хранить результат твоего труда там, где его не достанет ни одно правительство.",
      "buttons": ["Понял, но как это устроено", "Какие еще преимущества?"]
    },
    {
      "id": "msg_6_keys",
      "condition": "if user chooses 'Понял, но как это устроено' OR 'Какие еще преимущества?'",
      "text": "Отличный вопрос. Вот где начинается настоящая свобода.\n\nВ обычном мире банк даёт тебе приложение, карту, PIN-код. Но настоящие ключи у них. Они решают, когда ты можешь войти в аккаунт. В их силах закрыть его в любой момент.\n\nВ мире Bitcoin ключи только у тебя.\nЕсть 12 или 24 слова (их называют seed-фраза). Это твой личный ключ.\nКто владеет этими словами — владеет аккаунтом и биткоинами на нём. Точка.\nНе банк. Не правительство. Не приложение.\nТолько тот, кто знает seed-фразу.\n\nПотерял слова? Никто не поможет. Нет «восстановления пароля». Нет техподдержки.\nЭто цена свободы. Это ответственность.\nС ответственностью приходит свобода, ведь никто даже теоритически не сможет:\n- Заморозить твой счет\n- Забрать твои деньги\n- Ограничить твои траты\n- Потребовать объяснений\nТы даже можешь запомнить эти слова наизусть и перевезти любую сумму через любую границу, имея только слова в голове.\n\nЕсли у тебя есть ключи — ты владеешь своими деньгами.\nЕсли нет — ты просто гость в чужом доме.",
      "buttons": ["Вау, рассказывай дальше", "Как этим пользоваться в реальной жизни?"]
    },
    {
      "id": "msg_7_privacy",
      "condition": "if user chooses 'Вау, рассказывай дальше' OR 'Как этим пользоваться в реальной жизни?'",
      "text": "Теперь ты готов к следующему уровню.\n\nСистема хочет знать всё.\nЧто ты ел на завтрак. Куда ходил вчера. Сколько потратил на кофе. С кем встречался.\nБанки передают данные правительству. Google знает, где ты был. Твоя кредитная карта — дневник твоей жизни.\n\nВ Италии каждая транзакция больше €2000 автоматически отслеживается. Покупаешь подержанную машину у друга? Отчитайся перед государством.\n\nА если ты не хочешь? Bitcoin дает тебе выбор.\nТвой адрес — это просто набор букв и цифр. Никакого имени. Никакого паспорта.\nМожно создать новый адрес для каждой транзакции. За секунды. Бесплатно.\n\nХочешь отправить деньги другу? Никаких вопросов «Зачем?». Никаких комиссий банка. Никаких записей в твоем профиле.\n\nТвои траты — твое личное дело.\nДаже базовый уровень Bitcoin дает тебе больше свободы, чем любой банк в мире.",
      "buttons": ["Совсем никого между мной и получателем средств?!", "Можно ли это использовать для повседневных покупок или снимать наличные?"]
    },
    {
      "id": "msg_8_lightning",
      "condition": "if user chooses 'Совсем никого между мной и получателем средств?!' OR 'Можно ли это использовать для повседневных покупок или снимать наличные?'",
      "text": "Вот где Bitcoin становится оружием будущего.\n\nБиткоинами можно оплачивать огромное количество вещей, а количество стран и бизнесов где им можно оплачивать покупки постоянно растёт. Помимо оплаты в интернете, при необходимости есть сотни способов конвертации в наличные.\n\nПомнишь, в начале я говорил про награду? Ты получаешь сатоши (сокращенно — SATS).\nСатоши — это самая маленькая часть биткоина. В 1 биткоине 100 миллионов SATS. Они названы в честь меня — создателя Bitcoin, Сатоши Накамото.\n\nИ вот что важно: их можно отправлять друг другу за доли секунды.\nХочешь отправить деньги в Японию? 0.5 секунды.\nКомиссия? Меньше одного цента евро. Иногда доли цента.\nЭто называется Lightning Network.\n\nБезграничная сеть. Твой телефон подключается к миллионам узлов по всему миру.\nНикакого банка посередине. Никакой SWIFT. Никаких «рабочих часов».\nДеньги двигаются со скоростью мысли.",
      "buttons": ["Кому всё это нужно?", "Звучит сложно, нужно уметь программировать"]
    },
    {
      "id": "msg_9_coding",
      "condition": "if user chooses 'Звучит сложно, нужно уметь программировать'",
      "text": "Нет. Мы сделали это проще Glovo. Идем дальше."
    },
    {
      "id": "msg_10_club",
      "condition": "after msg_9_coding OR if user chooses 'Кому всё это нужно?'",
      "text": "Ты почти прошел 1 модуль и через пару минут сможешь забрать свою награду! Пора рассказать, куда ты попал.\n\nТы в клубе цифрового сопротивления авторитаризму.\n\nВсего будет 7 модулей.\nВ ближайшее время появятся:\n\n→ 2: Приватность и обход слежки\n→ 3: Защищенная коммуникация\n→ 4: Обход цензуры\n→ 5: Свободный доступ к знаниям\n→ 6: Техно-философия\n→ 7: Инструменты выживания оффлайн\n\nКаждый модуль — это навык. Каждый навык — это часть щита независимости.\n\nК концу ты будешь уметь:\nХранить деньги так, что никто их не заберет\n- Общаться так, что никто не прочитает\n- Получать информацию, которую пытаются скрыть\nВыживать в мире, где система пытается тебя контролировать\n\nА самое главное получишь десятки практических навыков для защиты своей свободы так, как нужно именно тебе. Никакой политической программы, только право человека на свободу!\n\nТа прозрачная карта — это пропуск в глобальную сеть людей, которые хотят жить в более честном мире. Передай карту тому, кто поймёт.\n\nМы строим параллельный интернет. И ты только что стал частью этого.",
      "buttons": ["Хорошо, готов забрать SATS"]
    },
    {
      "id": "msg_11_final",
      "condition": "if user chooses 'Хорошо, готов забрать SATS'",
      "text": "1000 SATS это примерно 7 евро. Это твои первые деньги, которые не принадлежат банку.\n\nЭти деньги реальны. Ты можешь их потратить уже сегодня.\n\nНо есть одна проблема… У тебя еще нет кошелька.\n\nПрямо сейчас эти SATS существуют только тут.\n\nТвой финальный шаг:\n\nСоздать личный Bitcoin-кошелек. Это займёт 2 минуты.\nИ все SATS, которые ты заработал, придут на твой адрес. Автоматически.\nЭто момент, когда теория становится реальностью.",
      "buttons": ["Давай создадим кошелек", "Нет, мне нужно подумать"]
    },
    {
      "id": "msg_12_wallet",
      "condition": "if user chooses 'Давай создадим кошелек'",
      "text": "Хороший выбор.\n\nДобро пожаловать в параллельную экономику.\n\nСейчас мы создадим твой кошелек. Следуй инструкциям внимательно."
    }
  ]
}
